{
	"pluginmetadataversion" : 2,
	"name": "CHIP-8 ROM Loader",
	"type": ["core", "ui", "architecture", "binaryview", "helper"],
	"api": ["python2", "python3"],
	"description": "Load and disassemble CHIP-8 ROM.",
	"longdescription": "CHIP-8 is an interpreted programming language, developed by Joseph Weisbecker. It was initially used on the COSMAC VIP and Telmac 1800 8-bit microcomputers in the mid-1970s. CHIP-8 programs are run on a CHIP-8 virtual machine.\n\nThere are multiple implementations of the CHIP-8 Interpreter VM. This plugin works with what's known as [_CowGod's_](http://devernay.free.fr/hacks/chip8/C8TECH10.HTM) implementation.\n\nDecided not to implement the interpreter data segment at virtual address 0-0x200 because I think the user will get confused when inspecting the image under the hexview. Besides, all of the ROMs I've seen use their own sprites located in the ROM data.\n\n![](https://raw.githubusercontent.com/uafio/BinaryNinja-CHIP8-Arch/master/assets/chip8arch.gif)\n\n",
	"license": {
		"name": "MIT",
		"text": "Copyright (c) 2020 Tsvetelin Choranov\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE."
	},
	"platforms" : ["Darwin", "Linux", "Windows"],
	"installinstructions" : {
		"Darwin" : "",
		"Linux" : "",
		"Windows" : ""
	},
	"version": "1.0.0",
	"author": "uafio",
	"minimumbinaryninjaversion": 1200
}
